# 宿題 3-1

「transaction_1」と「transaction_2」を結合（ユニオン）して、「tranaction.csv」を保存してください。
「transaction_detail_1」と「transaction_detail_2」を結合（ジョイン）して,、「tranaction_detail.csv」を保存してください。
それぞれ、結合前と結合後のデータフレイムの構造（項目数、行数、データ型、欠損値の有無など）を調べてください。
（ヒント）Pandas 「concat」メソッドを使う。

In [2]:
import pandas as pd

In [4]:
transaction_1 = pd.read_csv('transaction_1.csv')
transaction_1.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [5]:
transaction_detail_1 = pd.read_csv('transaction_detail_1.csv')
transaction_detail_1.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [6]:
transaction_2 = pd.read_csv('transaction_2.csv')
transaction = pd.concat([transaction_1, transaction_2], ignore_index=True)
transaction.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [7]:
print(len(transaction_1))
print(len(transaction_2))
print(len(transaction))

5000
1786
6786

In [8]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6786 entries, 0 to 6785
Data columns (total 4 columns):
transaction_id    6786 non-null object
price             6786 non-null int64
payment_date      6786 non-null object
customer_id       6786 non-null object
dtypes: int64(1), object(3)
memory usage: 212.2+ KB

In [9]:
transaction.isnull().sum()

transaction_id    0
price             0
payment_date      0
customer_id       0
dtype: int64

In [10]:
transaction.to_csv("transaction.csv",index=False)

In [11]:
transaction_detail_2 = pd.read_csv('transaction_detail_2.csv')
transaction_detail=pd.concat([transaction_detail_1,transaction_detail_2], ignore_index=True)
transaction_detail.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [12]:
print(len(transaction_detail_1))
print(len(transaction_detail_2))
print(len(transaction_detail))

5000
2144
7144

In [13]:
transaction_detail.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7144 entries, 0 to 7143
Data columns (total 4 columns):
detail_id         7144 non-null int64
transaction_id    7144 non-null object
item_id           7144 non-null object
quantity          7144 non-null int64
dtypes: int64(2), object(2)
memory usage: 223.4+ KB

In [14]:
# 欠損値のカウント(2)
transaction_detail.isnull().sum()

detail_id         0
transaction_id    0
item_id           0
quantity          0
dtype: int64

In [15]:
transaction_detail.to_csv("transaction_detail.csv",index=False)

In [16]:
transaction_detail = pd.read_csv("transaction_detail.csv")
transaction_detail

      detail_id transaction_id item_id  quantity
0             0    T0000000113    S005         1
1             1    T0000000114    S001         1
2             2    T0000000115    S003         1
3             3    T0000000116    S005         1
4             4    T0000000117    S002         2
...         ...            ...     ...       ...
7139       7139    T0000006894    S004         1
7140       7140    T0000006895    S002         1
7141       7141    T0000006896    S001         2
7142       7142    T0000006897    S002         1
7143       7143    T0000006898    S002         1

[7144 rows x 4 columns]